
/* Class = "UIButton"; normalTitle = "New Example Button 1"; ObjectID = "35F-cl-mdI"; */
"35F-cl-mdI.normalTitle" = "New Example Button 1";

/*! Class = "UIButton"; normalTitle = "New Example Button 2"; ObjectID = "COa-YO-eGf"; */
"COa-YO-eGf.normalTitle" = "Already Translated";

/* Class = "UIButton"; normalTitle = "New Example Button 4"; ObjectID = "xyz-12-345"; */
"xyz-12-345.normalTitle" = "New Example Button 4";

/* Completely custom comment structure in one line (new) */
"test.key" = "This is a test key (new)";

/* Completely custom comment structure in one line to be ignored (new) */
"test.key.ignored" = "This is a test key to be ignored #bc-ignore! (new)";

/* This key should be ignored when ignoreEmptyKeys is set */
"test.key.ignoreEmptyStrings" = " ";

/* test comment 1
   test comment 2 */
"test.multiline_comment" = "test.multiline_comment.value";

/* (test comment with brackets) */
"test.brackets_comment" = "test.brackets_comment";

/* test with % character 1 */
"more than 23% or less than 45%" = "more than 23%1$ or less than 45%2$";

/* test with % character 2 */
"%A%B%C" = "%1$A%2$B%3$C";

/* test with placeholders */
"%d%@%.2f" = "%1$d%2$@%3$.2f";
